let firstNameList = "赵-钱-孙-李-周-吴-郑-王-冯-陈-褚-卫-蒋-沈-韩-杨-朱-秦-尤-许-何-吕-施-张-孔-曹-严-华-金-魏-陶-姜-戚-谢-邹-喻-柏-水-窦-章-云-苏-潘-葛-奚-范-彭-郎-鲁-韦-昌-马-苗-凤-花-方-俞-任-袁-柳-酆-鲍-史-唐-费-廉-岑-薛-雷-贺-倪-汤-滕-殷-罗-毕-郝-邬-安-常-乐-于-时-傅-皮-卞-齐-康-伍-余-元-卜-顾-孟-平-黄-和-穆-萧-尹-姚-邵-湛-汪-祁-毛-禹-狄-米-贝-明-臧-计-伏-成-戴-谈-宋-茅-庞-熊-纪-舒-屈-项-祝-董-粱-杜-阮-蓝-闵-席-季-麻-强-贾-路-娄-危-江-童-颜-郭-梅-盛-林-刁-钟-徐-邱-骆-高-夏-蔡-田-樊-胡-凌-霍-虞-万-支-柯-昝-管-卢-莫-经-房-裘-缪-干-解-应-宗-丁-宣-贲-邓-郁-单-杭-洪-包-诸-左-石-崔-吉-钮-龚-程-嵇-邢-滑-裴-陆-荣-翁-荀-羊-於-惠-甄-麴-家-封-芮-羿-储-靳-汲-邴-糜-松-井-段-富-巫-乌-焦-巴-弓-牧-隗-山-谷-车-侯-宓-蓬-全-郗-班-仰-秋-仲-伊-宫-宁-仇-栾-暴-甘-钭-厉-戎-祖-武-符-刘-景-詹-束-龙-叶-幸-司-韶-郜-黎-蓟-薄-印-宿-白-怀-蒲-邰-从-鄂-索-咸-籍-赖-卓-蔺-屠-蒙-池-乔-阴-欎-胥-能-苍-双-闻-莘-党-翟-谭-贡-劳-逄-姬-申-扶-堵-冉-宰-郦-雍-舄-璩-桑-桂-濮-牛-寿-通-边-扈-燕-冀-郏-浦-尚-农-温-别-庄-晏-柴-瞿-阎-充-慕-连-茹-习-宦-艾-鱼-容-向-古-易-慎-戈-廖-庾-终-暨-居-衡-步-都-耿-满-弘-匡-国-文-寇-广-禄-阙-东-殴-殳-沃-利-蔚-越-夔-隆-师-巩-厍-聂-晁-勾-敖-融-冷-訾-辛-阚-那-简-饶-空-曾-毋-沙-乜-养-鞠-须-丰-巢-关-蒯-相-查-後-荆-红-游-竺-权-逯-盖-益-桓-公-万俟-司马-上官-欧阳-夏侯-诸葛-闻人-东方-赫连-皇甫-尉迟-公羊-澹台-公冶-宗政-濮阳-淳于-单于-太叔-申屠-公孙-仲孙-轩辕-令狐-钟离-宇文-长孙-慕容-鲜于-闾丘-司徒-司空-亓官-司寇-仉-督-子车-颛孙-端木-巫马-公西-漆雕-乐正-壤驷-公良-拓跋-夹谷-宰父-谷梁-晋-楚-闫-法-汝-鄢-涂-钦-段干-百里-东郭-南门-呼延-归-海-羊舌-微生-岳-帅-缑-亢-况-后-有-琴-梁丘-左丘-东门-西门-商-牟-佘-佴-伯-赏-南宫-墨-哈-谯-笪-年-爱-阳-佟-第五-言-福-百-家-姓-终";
let chatContentList = `1、婚姻的定义是：“得到一个人，失去全世界。”
　　2、都说证书具有一定的含金量，我把证书拿去烧了，但铁屑也没有找着！
　　3、系统居然怀疑我灌水，我身边又没有水龙头。哦…明白了，身上有一个…
　　4、有没有听过“大猪说有，小猪说没有”的故事？
　　5、哥哥是灰狼，妹妹是绵羊；哥家不缺粮，想你做新娘；“砰”的一声响，哥哥把命丧；“猎人”举枪笑，看看是你娘！
　　6、网上总说女人如衣服，我却郁闷了，找件合适的衣服怎么就那么难呢！
　　7、我不想再影响你的前途，你可以找到比我更好的人……我不想再欺骗你和自己，希望你原谅我吧！我会永远祝福你的。
　　8、春色满园关不住，我诱红杏出墙来。
　　9、梦想是个天真的词，实现梦想是一个残酷的词
　　10、始终没有沦为一名优秀的大学生，靠的就是坚强品质。
　　11、曾经以为，向你提出分手需要一生的勇气，但到今天，我不得不承认——要和你一起过下去所需的勇气其实更大。
　　12、大女人不可一日无权，小女人不可一日无钱！
　　13、人又不聪明，还学人家秃顶！！
　　14、帅有个屁用！到头来还不是被卒吃掉！
　　15、我不知道是我上了大学，还是大学上了我。
　　16、在恋爱中的男人往往说他愿为她下地狱。等结了婚，他便真的下了地狱。
　　17、我的领带又找不到了，是不是你昨天又没有找到抹布？
　　18、你是电，李四光，你是唯一的神话…
　　19、我视金钱为粪土，父母视我为化粪池
　　20、干掉鸟人我就是天使！
　　21、左手刻着我，右手写着你，心中充满爱，当我们掌心相对，心心相印时，所有的人都会看到——我爱你。
　　25、大部分人一辈子只做三件事：自欺、欺人、被人欺。
　　26、爷爷都是从孙子走过来的……
　　27、天若负我，我便昊；尔等若负我，我便晃！
　　28、世间本无沙漠，我每想你一次，上帝就落下一粒沙，从此便有了撒哈拉！
　　29、要想富，少养干部多养猪…
　　30、小样，见了我还不自刎！
　　31、你帅，你帅，你天下最帅，头顶一窝白菜，身披一条麻袋，腰缠一根海带，你以为你是东方不败，其实你是衰神二代。
　　32、你对我太好了，但要我付出跟你同样多去爱你，我又做不到。你这样付出只令我有太大太大的压力，我好辛苦，放过我吧！
　　33、你是风儿我是沙，你是皮鞋我是刷，你不理我我自杀。
　　34、好好活着，因为我们会死很久！
　　35、当男人想通了，女人想开了，世界自然就和平了！
　　36、人们说：”爱一个人是不求回报的。“但是我却要你给我回报---让我在有生之年把我的爱全部送给你。
　　37、问世间情为何物？一物降一物。
　　38、忽然想起上大学时，老师出对联：国兴旺，家兴旺，国家兴旺。班委对下联：天恢弘，地恢弘，天地恢弘！后来我被赶出了教室……因为我对的下联是：你妈的，他妈的，你他妈的！
　　39、笨人的可怕之处并不在其笨，而在其自作聪明。`

// 暴露方法 随机姓名

export let randName = () => {	
	let myRandomNum = randomNum(1,3);
	let result = firstName();

	while(myRandomNum--){
		result += randomCN();
	}
	
	return result;
}

// 暴露方法，随机聊天语句
export let randomChatContent = () => {
	let myChatContentList = chatContentList.split(`\n`);
	for(var i = 0; i < myChatContentList.length; i++){
		myChatContentList[i] = myChatContentList[i].replace(/\s*\d*、/g,"");
	}
	// console.log(myChatContentList);

	return myChatContentList[randomNum(myChatContentList.length - 1)];
}
// 暴露方法 返回指定范围的随机整数 【start，end】
export let randomNum = (start,end) => {
	if(end){
		return Math.floor(Math.random() * (end + 1 - start)) + start;
	}
	return Math.floor(Math.random() * start + 1);
	
}


// 随机取姓
let firstName = () =>{	
	let firstNameArr = firstNameList.split("-");
	let myRandomNum = randomNum(firstNameArr.length);
	let result = firstNameArr[myRandomNum];	
	
	return result;
}
// 随机取字
let randomCN = () => {
	// 随机unicode
	let randomUnicode = randomUnicodeFunction();

	// uncode转字符
	let str = String.fromCharCode(randomUnicode.toString());	
	return str;
}

// 函数 随机中文unicode生成
// 范围 4E00-9FA5
// 直接随机
function randomUnicodeFunction () {
	// 随机生成unicode 十进制的
	const minCode = parseInt("4E00", 16);
	const maxCode = parseInt("9FA5", 16);
	// console.log(minCode);
	// console.log(maxCode);

	let result = randomNum(minCode,maxCode);
	// console.log(result);

	return result 		
				
}	
// 返回指定范围的随机数
// 包括start，end
// 只传一个参数 默认 （0-start）
